blog/6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-27 Tue 22:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP. 1.2.4</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP. 1.2.4
<br />
<span class="subtitle">2022-12-27 Tue</span>
</h1>
<p>
The authors present a procedure that evolves a linear recursive
process to compute the exponential of a given number (here translated
in Emacs Lisp):
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">expt</span> (b n)
  (<span style="color: #b9ca4a;">if</span> (= n 0)
      1
    (* b (expt b (- n 1)))))
</pre>
</div>
<p>
This requires  \(\Theta(n)\) steps and  \(\Theta(n)\) space.
</p>

<p>
We have have already seen such a kind of process (linear recursion)
with factorial. Just as they have done with factorial, the authors
present a procedure that evolves a linear iterative process to compute
the exponentional of a given number:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">expt-iter</span> (b counter product)
  (<span style="color: #b9ca4a;">if</span> (= counter 0)
      product
    (expt-iter b
               (- counter 1)
               (* b product))))
</pre>
</div>
<p>
This process requires \(\Theta(n)\) steps and \(\Theta(1)\) space.
</p>

<p>
Then, the authors show that we can be faster:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fast-expt</span> (b n)
  (<span style="color: #b9ca4a;">cond</span> ((= n 0)
         1)
        ((evenp n)
         (square (fast-expt b (/ n 2))))
        (t
         (* b (fast-expt b (- n 1))))))

(<span style="color: #b9ca4a;">defun</span> (evenp n)
    (= (% n 2) 0))
</pre>
</div>
<p>
<code>fast-expt</code> evolves a process that grows <i>logarithmically</i> with n in
both space and time.
</p>

<div id="outline-container-orge43b489" class="outline-2">
<h2 id="orge43b489">Exercise 1.16</h2>
<div class="outline-text-2" id="text-orge43b489">
<p>
Exercise:
</p>
<blockquote>
<p>
Design a procedure that evolves an iterative exponentiation process
that uses successive squaring and uses a logarithmic number of steps,
as does <code>fast-expt</code>. (Hint: Using the observation that \((b^{b/2})^2 =
(b^2)^{n/2}\), keep, along with the exponent n and the base b, an
additional state variable a, and define the state transformation in
such a way that the product abn is unchanged from state to state. At
the beginning of the process a is taken to be 1, and the answer is
given by the value of a at the end of the process. In general, the
technique of defining an invariant quantity that remains unchanged
from state to state is a powerful way to think about the design of
iterative algorithms.)
</p>
</blockquote>

<p>
Answer:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fast-expt-i</span> (b n)
  (fast-expt-iter b n 1))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fast-expt-iter</span> (b n a)
  (<span style="color: #b9ca4a;">cond</span> ((= n 0) a)
        ((even n)
         (fast-expt-iter (square b) (/ n 2) a))
        (t
         (fast-expt-iter b (- n 1) (* b a)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff37c2e" class="outline-2">
<h2 id="orgff37c2e">Exercise 1.17</h2>
<div class="outline-text-2" id="text-orgff37c2e">
<p>
Exercise:
</p>
<blockquote>
<p>
The exponentiation algorithms in this section are based on performing
exponentiation by means of repeated multiplication. In a similar way,
one can perform integer multiplication by means of repeated
addition. The following multiplication procedure (in which it is
assumed that our language can only add, not multiply) is analogous to
the expt procedure:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #b9ca4a;">define</span> (<span style="color: #e78c45;">*</span> a b)
  (<span style="color: #b9ca4a;">if</span> (= b 0)
      0
      (+ a (* a (- b 1)))))
</pre>
</div>
<p>
This algorithm takes a number of steps that is linear in b. Now
suppose we include, together with addition, operations double, which
doubles an integer, and halve, which divides an (even) integer
by 2. Using these, design a multiplication procedure analogous to
fast-expt that uses a logarithmic number of steps.
</p>
</blockquote>

<p>
Answer:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">double</span> (a)
  (* a 2))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">halve</span> (a)
  (/ a 2))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fast-*</span> (a b)
  (<span style="color: #b9ca4a;">cond</span> ((= b 1) a)
        ((even b) (double (fast-* a (halve b))))
        (t (+ a (fast-* a (- b 1))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7441216" class="outline-2">
<h2 id="org7441216">Exercise 1.18</h2>
<div class="outline-text-2" id="text-org7441216">
<p>
Exercise:
</p>
<blockquote>
<p>
Using the results of Exercise 1.16 and Exercise 1.17, devise a
procedure that generates an iterative process for multiplying two
integers in terms of adding, doubling, and halving and uses a
logarithmic number of steps (fn: This algorithm, which is sometimes
known as the “Russian peasant method” of multiplication, is
ancient. Examples of its use are found in the Rhind Papyrus, one of
the two oldest mathematical documents in existence, written about 1700
B.C. (and copied from an even older document) by an Egyptian scribe
named A’h-mose.)
</p>
</blockquote>

<p>
Answer:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fast-*-i</span> (a b)
  (fast-*-iter a b 0))

(<span style="color: #b9ca4a;">defun</span> <span style="color: #e78c45;">fast-*-iter</span> (a b c)
  (<span style="color: #b9ca4a;">cond</span> ((= c 0) 0)
        ((even b) (fast-*-iter (double a) (halve b) c))
        (t (fast-*-iter a (- b 1) (+ a c))
</pre>
</div>

<div style="text-align: center;">
<a href="https://pietroiusti.github.io/blog/posts.html">←</a>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Please, send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> if you have any comment.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</span></p>
</div>
</body>
</html>
